junyu1130/Mac-STM32/STM32F407VET6/MotionDetector/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include "MPU6050.h"
#include "ESP8266.h"
#include "usart.h"
#include "tim.h"
#include "DigitalTube.h"
#include "rtc.h"
#include "fatfs.h"
#include "w25qxx.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//WIFI配置
#define WIFI_NAME       "MotionDetector"
#define WIFI_PASSWD     "12345678"
#define UDP_IP          "192.168.4.2"
#define UDP_PORT        9000
//W25QXX FLASH
#define FLASH_BUF_MAX 100
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */
extern uint32_t g_time_count;

uint8_t g_seg_show = 2;//数码管默认显示秒、百分秒
int g_timetxt_count = 0;//记录时间的文件数据个数
bool g_mpu_start = false;//开始读取
bool g_mpu_save = false;//一个缓冲区存满可以存到flash中
bool g_mpu_end = false;//最后结束的一部分缓冲区存入flash
uint8_t g_mpu_data_save_dir = 1;//双缓冲存储 flash存储100组数据大概1.5s
char g_mpu_data_buf1[FLASH_BUF_MAX][150];
char g_mpu_data_buf2[FLASH_BUF_MAX][150];
int g_mpu_data_index_1 = 0;
int g_mpu_data_index_2 = 0;
int g_mpu_data_save_num = 0;//测试
int g_mpu_data_read_num = 0;

bool g_wifi_udp_en = false;
/* USER CODE END Variables */
/* Definitions for MainTask */
osThreadId_t MainTaskHandle;
const osThreadAttr_t MainTask_attributes = {
        .name = "MainTask",
        .priority = (osPriority_t) osPriorityAboveNormal,
        .stack_size = 256 * 4
};
/* Definitions for KeyTask */
osThreadId_t KeyTaskHandle;
const osThreadAttr_t KeyTask_attributes = {
        .name = "KeyTask",
        .priority = (osPriority_t) osPriorityNormal,
        .stack_size = 2048 * 4
};
/* Definitions for DigitaTubeTask */
osThreadId_t DigitaTubeTaskHandle;
const osThreadAttr_t DigitaTubeTask_attributes = {
        .name = "DigitaTubeTask",
        .priority = (osPriority_t) osPriorityAboveNormal,
        .stack_size = 256 * 4
};
/* Definitions for RTCTask */
osThreadId_t RTCTaskHandle;
const osThreadAttr_t RTCTask_attributes = {
        .name = "RTCTask",
        .priority = (osPriority_t) osPriorityNormal,
        .stack_size = 256 * 4
};
/* Definitions for SaveTask */
osThreadId_t SaveTaskHandle;
const osThreadAttr_t SaveTask_attributes = {
        .name = "SaveTask",
        .priority = (osPriority_t) osPriorityNormal,
        .stack_size = 2048 * 4
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */
void SaveTime(void);

void PrintfTime(void);

void SavePara(void);

void LoadPara(void);

void SaveData(void);

void PrintfData(void);

/* USER CODE END FunctionPrototypes */

void StartMainTask(void *argument);

void StartKeyTask(void *argument);

void StartDigitaTubeTask(void *argument);

void StartRTCTask(void *argument);

void StartSaveTask(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* USER CODE BEGIN RTOS_MUTEX */
    /* add mutexes, ... */
    /* USER CODE END RTOS_MUTEX */

    /* USER CODE BEGIN RTOS_SEMAPHORES */
    /* add semaphores, ... */
    /* USER CODE END RTOS_SEMAPHORES */

    /* USER CODE BEGIN RTOS_TIMERS */
    /* start timers, add new ones, ... */
    /* USER CODE END RTOS_TIMERS */

    /* USER CODE BEGIN RTOS_QUEUES */
    /* add queues, ... */
    /* USER CODE END RTOS_QUEUES */

    /* Create the thread(s) */
    /* creation of MainTask */
    MainTaskHandle = osThreadNew(StartMainTask, NULL, &MainTask_attributes);

    /* creation of KeyTask */
    KeyTaskHandle = osThreadNew(StartKeyTask, NULL, &KeyTask_attributes);

    /* creation of DigitaTubeTask */
    DigitaTubeTaskHandle = osThreadNew(StartDigitaTubeTask, NULL, &DigitaTubeTask_attributes);

    /* creation of RTCTask */
    RTCTaskHandle = osThreadNew(StartRTCTask, NULL, &RTCTask_attributes);

    /* creation of SaveTask */
    SaveTaskHandle = osThreadNew(StartSaveTask, NULL, &SaveTask_attributes);

    /* USER CODE BEGIN RTOS_THREADS */
    /* add threads, ... */
    /* USER CODE END RTOS_THREADS */

    /* USER CODE BEGIN RTOS_EVENTS */
    /* add events, ... */
    /* USER CODE END RTOS_EVENTS */

}

/* USER CODE BEGIN Header_StartMainTask */
/**
  * @brief  Function implementing the MainTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartMainTask */
void StartMainTask(void *argument) {
    /* USER CODE BEGIN StartMainTask */
    uint32_t save_tick = 0;
    uint32_t print_tick = 0;
    char mpu_data[150];
    char send_data[150] = {0};

    float SelfTest[6];               // Gyro and accelerometer self-test sensor output
    float aRes, gRes;                // scale resolutions per LSB for the sensors
    int16_t accelCount[3];           // Stores the 16-bit signed accelerometer sensor output
    float ax, ay, az;                // Stores the real accel value in g's
    int16_t gyroCount[3];            // Stores the 16-bit signed gyro sensor output
    float gx, gy, gz;                // Stores the real gyro value in degrees per seconds
    float gyroBias[3], accelBias[3]; // Bias corrections for gyro and accelerometer
    int16_t tempCount;               // Stores the internal chip temperature sensor output
    float temperature;               // Scaled temperature in degrees Celsius

    if (MPU6050_Check() == MPU6050_ADDRESS) {
        MPU6050_SelfTest(SelfTest); // Start by performing self test and reporting values
        printf("x-axis self test: acceleration trim within : ");
        printf("%.1f", SelfTest[0]);
        printf("%% of factory value\r\n");
        printf("y-axis self test: acceleration trim within : ");
        printf("%.1f", SelfTest[1]);
        printf("%% of factory value\r\n");
        printf("z-axis self test: acceleration trim within : ");
        printf("%.1f", SelfTest[2]);
        printf("%% of factory value\r\n");
        printf("x-axis self test: gyration trim within : ");
        printf("%.1f", SelfTest[3]);
        printf("%% of factory value\r\n");
        printf("y-axis self test: gyration trim within : ");
        printf("%.1f", SelfTest[4]);
        printf("%% of factory value\r\n");
        printf("z-axis self test: gyration trim within : ");
        printf("%.1f", SelfTest[5]);
        printf("%% of factory value\r\n");

