junyu1130/Mac-STM32/STM32F407VET6/MotionDetector/Core/Src/freertos.c
        if (SelfTest[0] < 1.0f && SelfTest[1] < 1.0f && SelfTest[2] < 1.0f && SelfTest[3] < 1.0f &&
            SelfTest[4] < 1.0f && SelfTest[5] < 1.0f) {
            printf("Pass Selftest!\r\n");

            MPU6050_calibrate(gyroBias, accelBias); // Calibrate gyro and accelerometers, load biases in bias registers
            MPU6050_init();
            printf("MPU6050 initialized for active data mode....\r\n"); // Initialize device for active mode read of acclerometer, gyroscope, and temperature
        } else {
            printf("Could not connect to MPU6050\r\n");
        }
    }

    HAL_UART_Receive_IT(&huart6, &rx_byte, 1);

    if (ESP8266_Init()) {
        printf("ESP8266 Init OK!\r\n");
    } else {
        printf("ESP8266 Init FAIL!\r\n");
    }

    if (ESP8266_AP(WIFI_NAME, WIFI_PASSWD)) {
        printf("ESP8266 Create AP OK!\r\n");
    } else {
        printf("ESP8266 Create AP FAIL!\r\n");
    }
    printf("Press K5 to Create UDP.\r\n");
    /* Infinite loop */
    for (;;) {
        if (g_mpu_start == true) {
            if (osKernelGetTickCount() - save_tick >= 50) {
                save_tick = osKernelGetTickCount();
                if (MPU6050_readByte(MPU6050_ADDRESS, INT_STATUS) & 0x01) {  // check if data ready interrupt
                    MPU6050_readAccelData(accelCount);  // Read the x/y/z adc values
                    aRes = MPU6050_getAres();

                    // Now we'll calculate the accleration value into actual g's
                    ax = (float) accelCount[0] * aRes -
                         accelBias[0];  // get actual g value, this depends on scale being set
                    ay = (float) accelCount[1] * aRes - accelBias[1];
                    az = (float) accelCount[2] * aRes - accelBias[2];

                    MPU6050_readGyroData(gyroCount);  // Read the x/y/z adc values
                    gRes = MPU6050_getGres();

                    // Calculate the gyro value into actual degrees per second
                    gx = (float) gyroCount[0] * gRes -
                         gyroBias[0];  // get actual gyro value, this depends on scale being set
                    gy = (float) gyroCount[1] * gRes - gyroBias[1];
                    gz = (float) gyroCount[2] * gRes - gyroBias[2];

                    tempCount = MPU6050_readTempData();  // Read the x/y/z adc values
                    temperature = ((float) tempCount) / 340. + 36.53; // Temperature in degrees Centigrade

                    uint8_t test_min = (g_time_count / 100) / 60;
                    uint8_t test_sec = (g_time_count / 100) % 60;
                    uint8_t test_sec_100 = g_time_count % 100;
                    sprintf(mpu_data,
                            "ax:%6.1f mg, ay:%6.1f mg, az:%6.1f mg  gx:%6.1f deg/s, gy:%6.1f deg/s, gz:%6.1f deg/s  (%02d:%02d:%02d)\r\n",
                            1000 * ax, 1000 * ay, 1000 * az, gx, gy, gz, test_min, test_sec, test_sec_100);
                    if (g_mpu_data_save_dir == 1) {
                        strcpy(g_mpu_data_buf1[g_mpu_data_index_1], mpu_data);
                        if (g_mpu_data_index_1 < FLASH_BUF_MAX - 1) {
                            g_mpu_data_index_1++;
                        } else {
                            g_mpu_data_index_1 = 0;
                            g_mpu_data_save_dir = 2;
                            g_mpu_save = true;
                        }
                    } else if (g_mpu_data_save_dir == 2) {
                        strcpy(g_mpu_data_buf2[g_mpu_data_index_2], mpu_data);
                        if (g_mpu_data_index_2 < FLASH_BUF_MAX - 1) {
                            g_mpu_data_index_2++;
                        } else {
                            g_mpu_data_index_2 = 0;
                            g_mpu_data_save_dir = 1;
                            g_mpu_save = true;
                        }
                    }
                }
            }

            if (osKernelGetTickCount() - print_tick >= 500) {//500ms
                print_tick = osKernelGetTickCount();
                uint8_t test_min = (g_time_count / 100) / 60;
                uint8_t test_sec = (g_time_count / 100) % 60;
                uint8_t test_sec_100 = g_time_count % 100;
                sprintf(send_data,
                        "HDU;%02d:%02d:%02d;%.1f;%.1f;%.1f;%.1f;%.1f;%.1f",
                        test_min, test_sec, test_sec_100, 1000 * ax, 1000 * ay, 1000 * az, gx, gy, gz);
                printf("%s\r\n", send_data);
                if (g_wifi_udp_en == true) {
                    ESP8266_UDP_Send(send_data);
                }
            }
        }
        osDelay(1);
    }
    /* USER CODE END StartMainTask */
}

/* USER CODE BEGIN Header_StartKeyTask */
/**
* @brief Function implementing the KeyTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartKeyTask */
void StartKeyTask(void *argument) {
    /* USER CODE BEGIN StartKeyTask */
    uint8_t key_state;
    bool wifi_udp_flag = true;

    W25QXX_Init();
    printf("W25QXX FLASH ID = 0x%04X\r\n", W25QXX_ReadID());
    LoadPara();
    /* Infinite loop */
    for (;;) {
        //扫描按键
        key_state = 0;
        if (HAL_GPIO_ReadPin(KEY1_GPIO_Port, KEY1_Pin) == GPIO_PIN_RESET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY1_GPIO_Port, KEY1_Pin) == GPIO_PIN_RESET) {
                key_state = 1;
            }
            while (HAL_GPIO_ReadPin(KEY1_GPIO_Port, KEY1_Pin) == GPIO_PIN_RESET) {
                osDelay(1);
            }
        } else if (HAL_GPIO_ReadPin(KEY2_GPIO_Port, KEY2_Pin) == GPIO_PIN_RESET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY2_GPIO_Port, KEY2_Pin) == GPIO_PIN_RESET) {
                key_state = 2;
            }
            while (HAL_GPIO_ReadPin(KEY2_GPIO_Port, KEY2_Pin) == GPIO_PIN_RESET) {
                osDelay(1);
            }
        } else if (HAL_GPIO_ReadPin(KEY3_GPIO_Port, KEY3_Pin) == GPIO_PIN_RESET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY3_GPIO_Port, KEY3_Pin) == GPIO_PIN_RESET) {
                key_state = 3;
            }
            while (HAL_GPIO_ReadPin(KEY3_GPIO_Port, KEY3_Pin) == GPIO_PIN_RESET) {
                osDelay(1);
            }
        } else if (HAL_GPIO_ReadPin(KEY4_GPIO_Port, KEY4_Pin) == GPIO_PIN_RESET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY4_GPIO_Port, KEY4_Pin) == GPIO_PIN_RESET) {
                key_state = 4;
            }
            while (HAL_GPIO_ReadPin(KEY4_GPIO_Port, KEY4_Pin) == GPIO_PIN_RESET) {
                osDelay(1);
            }
        } else if (HAL_GPIO_ReadPin(KEY5_GPIO_Port, KEY5_Pin) == GPIO_PIN_SET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY5_GPIO_Port, KEY5_Pin) == GPIO_PIN_SET) {
                key_state = 5;
            }
            while (HAL_GPIO_ReadPin(KEY5_GPIO_Port, KEY5_Pin) == GPIO_PIN_SET) {
                osDelay(1);
            }
        } else if (HAL_GPIO_ReadPin(KEY6_GPIO_Port, KEY6_Pin) == GPIO_PIN_SET) {
            osDelay(10);
            if (HAL_GPIO_ReadPin(KEY6_GPIO_Port, KEY6_Pin) == GPIO_PIN_SET) {
                key_state = 6;
            }
            while (HAL_GPIO_ReadPin(KEY6_GPIO_Port, KEY6_Pin) == GPIO_PIN_SET) {
                osDelay(1);
            }
        }

        //按键触发控制
        switch (key_state) {
            case 1://读取测试时间记录
                PrintfTime();
                break;
            case 2:
                g_seg_show = 1;//数码管显示分、秒
                break;
            case 3:
                g_seg_show = 2;//数码管显示秒、百分秒
                break;
            case 4:
                PrintfData();
                break;
            case 5://建立UDP，清零并开始计时
                if (wifi_udp_flag == true) {
                    wifi_udp_flag = false;
                    if (ESP8266_UDP_Connect(UDP_IP, UDP_PORT)) {
                        printf("ESP8266 Create UDP OK!\r\n");
                        g_wifi_udp_en = true;
                    } else {
                        printf("ESP8266 Create UDP FAIL!\r\n");
                    }
                    printf("Now press K5 to start.\r\n");
                } else {
                    g_time_count = 0;
                    f_unlink("0:/data.txt");
                    g_mpu_data_save_dir = 1;
                    g_mpu_data_index_1 = 0;
                    g_mpu_data_index_2 = 0;
                    g_mpu_data_save_num = 0;
                    HAL_TIM_Base_Start_IT(&htim3);
                    g_mpu_start = true;
                }
                break;
            case 6://停止计时并记录
                HAL_TIM_Base_Stop_IT(&htim3);
                g_mpu_start = false;
                g_mpu_end = true;
                char send_data[10];
                sprintf(send_data, "STOP");
                printf("%s\r\n", send_data);
                ESP8266_UDP_Send(send_data);
                if (g_timetxt_count >= 100) {//大于100个数据时覆盖文件
                    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
                    f_unlink("0:/time.txt");
                    printf("The time record data has exceeded 100. This file has been overwritten for you.\r\n");
                    g_timetxt_count = 0;
                    osDelay(1000);
                    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
                } else {
                    SaveTime();
                    g_timetxt_count++;
                    SavePara();
                    printf("Save time OK! Now time.txt have %d data.\r\n", g_timetxt_count);
                }
                break;
            default:
                break;
        }
        osDelay(1);
    }
    /* USER CODE END StartKeyTask */
}

/* USER CODE BEGIN Header_StartDigitaTubeTask */
/**
* @brief Function implementing the DigitaTubeTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartDigitaTubeTask */
void StartDigitaTubeTask(void *argument) {
    /* USER CODE BEGIN StartDigitaTubeTask */
    uint8_t seg[4] = {0};
    /* Infinite loop */
    for (;;) {
        if (g_seg_show == 1) {//分、秒
            seg[0] = ((g_time_count / 100) / 60) / 10;
            seg[1] = ((g_time_count / 100) / 60) % 10;
            seg[2] = ((g_time_count / 100) % 60) / 10;
            seg[3] = ((g_time_count / 100) % 60) % 10;
        } else if (g_seg_show == 2) {//秒、百分秒
            seg[0] = ((g_time_count / 100) % 60) / 10;
            seg[1] = ((g_time_count / 100) % 60) % 10;
            seg[2] = (g_time_count % 100) / 10;
            seg[3] = g_time_count % 10;
        }
        for (int i = 0; i < 4; ++i) {
            if (i == 1 && osKernelGetTickCount() % 1000 < 500) {
                Write595(i, seg[i], 1);
            } else {
                Write595(i, seg[i], 0);
            }
            osDelay(5);
        }
    }
    /* USER CODE END StartDigitaTubeTask */
}

/* USER CODE BEGIN Header_StartRTCTask */
/**
* @brief Function implementing the RTCTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartRTCTask */
void StartRTCTask(void *argument) {
    /* USER CODE BEGIN StartRTCTask */
    uint32_t tick = 0;
    /* Infinite loop */
    for (;;) {
        if (osKernelGetTickCount() - tick >= 1000) {
            tick = osKernelGetTickCount();
            ReadRTCDateTime();
        }
        osDelay(1);
    }
    /* USER CODE END StartRTCTask */
}

/* USER CODE BEGIN Header_StartSaveTask */
/**
* @brief Function implementing the SaveTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartSaveTask */
void StartSaveTask(void *argument) {
    /* USER CODE BEGIN StartSaveTask */
    /* Infinite loop */
    for (;;) {
        if (g_mpu_save == true) {
            SaveData();
            g_mpu_save = false;
        } else if (g_mpu_end == true) {
            SaveData();
            g_mpu_end = false;
            printf("Save MPU Data OK!\r\n");
        }
        osDelay(1);
    }
    /* USER CODE END StartSaveTask */
}

