junyu1130/Mac-STM32/STM32F407VET6/MotionDetector/Core/Src/freertos.c
/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */
void SaveTime(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果
    char buf[100];

    res = f_open(&fil, "0:/time.txt", FA_OPEN_ALWAYS | FA_WRITE | FA_OPEN_APPEND);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        uint8_t test_min = (g_time_count / 100) / 60;
        uint8_t test_sec = (g_time_count / 100) % 60;
        uint8_t test_sec_100 = g_time_count % 100;
        sprintf(buf, "Test Time:%02d:%02d:%02d (%4d.%2d.%2d %02d:%02d:%02d)\r\n", test_min, test_sec, test_sec_100,
                RTC_Year, RTC_Mon, RTC_Dat, RTC_Hour,
                RTC_Min, RTC_Sec);
        f_puts(buf, &fil);
        f_close(&fil);
    }
}

void PrintfTime(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果
    char buf[100];

    res = f_open(&fil, "0:/time.txt", FA_READ | FA_OPEN_ALWAYS);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        f_lseek(&fil, 0);
        while (f_gets(buf, 100, &fil)) {
            printf("%s", buf);
        }
        f_close(&fil);
    }
}

void SavePara(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果

    res = f_open(&fil, "0:/para.txt", FA_WRITE | FA_OPEN_ALWAYS);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        f_lseek(&fil, 0);
        f_printf(&fil, "time.txt count:%d\r\n", g_timetxt_count);
        f_close(&fil);
    }
}

void LoadPara(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果
    char buf[50];

    res = f_open(&fil, "0:/para.txt", FA_READ | FA_OPEN_ALWAYS);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        f_lseek(&fil, 0);
        while (f_gets(buf, 50, &fil)) {
            if (strstr(buf, "time.txt count:") != NULL) {
                g_timetxt_count = atoi(buf + 15);
            } else {
                printf("load error!\r\n");
            }
        }
        f_close(&fil);
    }
}

void SaveData(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果

    res = f_open(&fil, "0:/data.txt", FA_OPEN_ALWAYS | FA_WRITE | FA_OPEN_APPEND);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        for (int i = 0; i < FLASH_BUF_MAX; ++i) {
            g_mpu_data_save_num++;
            if (g_mpu_end == false) {
                if (g_mpu_data_save_dir == 1) {
                    f_puts(g_mpu_data_buf2[i], &fil);
                } else if (g_mpu_data_save_dir == 2) {
                    f_puts(g_mpu_data_buf1[i], &fil);
                }
            } else {
                if (g_mpu_data_save_dir == 1) {
                    f_puts(g_mpu_data_buf1[i], &fil);
                    if (i == g_mpu_data_index_1 - 1) {
                        break;
                    }
                } else if (g_mpu_data_save_dir == 2) {
                    f_puts(g_mpu_data_buf2[i], &fil);
                    if (i == g_mpu_data_index_2 - 1) {
                        break;
                    }
                }
            }
        }
        f_close(&fil);
    }
}

void PrintfData(void) {
    FIL fil;//文件对象
    FRESULT res;//操作返回结果
    char buf[150];

    res = f_open(&fil, "0:/data.txt", FA_READ | FA_OPEN_ALWAYS);
    if (res != FR_OK) {
        printf("open file error.\r\n");
    } else {
        f_lseek(&fil, 0);
        while (f_gets(buf, 150, &fil)) {
            printf("%s", buf);
            g_mpu_data_read_num++;
        }
        printf("save data num:%d, read data num:%d\r\n", g_mpu_data_save_num, g_mpu_data_read_num);
        if (g_mpu_data_save_num == g_mpu_data_read_num) {
            printf("all data is saved.\r\n");
        } else {
            printf("not all data is saved, please check it.\r\n");
        }
        g_mpu_data_read_num = 0;

        f_close(&fil);
    }
}
/* USER CODE END Application */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
